[Killed] BlockStatement
src/utils/formatSeverity.ts:8:58
  * Example:
  * 1 → "Low", 3 → "Moderate", 5 → "High"
  */
-export function formatSeverity(severity: number): string {
-  if (severity <= 2) return "Low";
-  if (severity <= 4) return "Moderate";
-  return "High";
-}
+export function formatSeverity(severity: number): string {}
 
killedBy: formatSeverity() returns 'Low' for severity 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Low"
Received: undefined

[Killed] ConditionalExpression
src/utils/formatSeverity.ts:9:7
  * 1 → "Low", 3 → "Moderate", 5 → "High"
  */
 export function formatSeverity(severity: number): string {
-  if (severity <= 2) return "Low";
+  if (false) return "Low";
   if (severity <= 4) return "Moderate";
   return "High";
killedBy: formatSeverity() returns 'Low' for severity 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Low"
Received: "Moderate"

[Killed] EqualityOperator
src/utils/formatSeverity.ts:9:7
  * 1 → "Low", 3 → "Moderate", 5 → "High"
  */
 export function formatSeverity(severity: number): string {
-  if (severity <= 2) return "Low";
+  if (severity > 2) return "Low";
   if (severity <= 4) return "Moderate";
   return "High";
killedBy: formatSeverity() returns 'Low' for severity 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Low"
Received: "Moderate"

[Killed] EqualityOperator
src/utils/formatSeverity.ts:10:7
  */
 export function formatSeverity(severity: number): string {
   if (severity <= 2) return "Low";
-  if (severity <= 4) return "Moderate";
+  if (severity < 4) return "Moderate";
   return "High";
 }
killedBy: formatSeverity() handles edge case at threshold correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Moderate"
Received: "High"

[Killed] ConditionalExpression
src/utils/formatSeverity.ts:10:7
  */
 export function formatSeverity(severity: number): string {
   if (severity <= 2) return "Low";
-  if (severity <= 4) return "Moderate";
+  if (false) return "Moderate";
   return "High";
 }
killedBy: formatSeverity() returns 'Moderate' for severity 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Moderate"
Received: "High"
